# Fabric Sheet Distribution Of Wires At Cover Property

Source: https://www.revitapidocs.com/2026/d0ff8f7e-8c8f-4bfa-b0ab-ac3d8514140e.htm

---

| Fabric Sheet Distribution Of Wires At Cover Property |
| --- |

The distribution of wires that is closest to the cover.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public WireDistributionDirection DistributionOfWiresAtCover { get; set; }
```

```
Public Property DistributionOfWiresAtCover As WireDistributionDirection
	Get
	Set
```

```
public:
property WireDistributionDirection DistributionOfWiresAtCover {
	WireDistributionDirection get ();
	void set (WireDistributionDirection value);
}
```

```
member DistributionOfWiresAtCover : WireDistributionDirection with get, set
```

#### Property Value

WireDistributionDirection Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: This fabric sheet is bent. Method shall be called only for flat fabric sheets. |

Remarks This parameter is only relevant for instances of flat fabric sheets.
 Fabric sheets are created with the Major distribution set at the cover by default. See Also

#### Reference

FabricSheet Class Autodesk.Revit.DB.Structure Namespace